# ------------------------------------------------------------------------------------------------------
# Unit 17. while 반복문
# ------------------------------------------------------------------------------------------------------
# 17.1 while 반복문 사용하기
# ------------------------------------------------------------------------------------------------------
i = 0                           # 초기식

while i < 100:                  # while 조건식
    print('Hello, world!')      # 반복할 코드
    i += 1                      # 변화식

# 17.1.1 초깃값을 1부터 시작하기
i = 1

while i <= 100:
    print('Hello, world!', i)
    i += 1

# 17.1.2 초깃값을 감소시키기
i = 100

while i > 0:
    print('Hello', i)
    i -= 1

# 17.1.3 입력한 횟수대로 반복하기
# count = int(input('반복할 횟수를 입력하세요 : '))

# i = 0
# while i < count:
#     print('world!', i)
#     i += 1

# count = int(input('반복할 횟수를 입력하세요 : '))

# while count > 0:
#     print('Hi', count)
#     count -= 1

# ------------------------------------------------------------------------------------------------------
# 17.2 반복 횟수가 정해지지 않은 경우
# ------------------------------------------------------------------------------------------------------
## 난수(random number) : 특정 주기로 반복되지 않으며 규칙 없이 무작위로 나열되는 숫자
import random

print(random.random())
print(random.random())

## randint : 랜덤 정수
print(random.randint(1, 6))
print(random.randint(1, 6))

i = 0

while i != 3:
    i = random.randint(1, 6)
    print(i)

print('-----------------------------')

## 시퀀스 객체에서 요소를 무작위로 선택 (tuple, range, 문자열도 가능)
dice = [1, 2, 3, 4, 5, 6]
print(random.choice(dice))
print(random.choice(dice))

# ------------------------------------------------------------------------------------------------------
# 17.3 while 반복문으로 무한 루프 만들기
# ------------------------------------------------------------------------------------------------------
# while True:
#     print('Hello, world~')

# while 1:
#     print('Hello, world!')

# while 'Hello':
#     print('Hello, world~')

# 심사문제
# money = int(input())

# while money >= 1350:
#     money -= 1350
#     print(money)


# ------------------------------------------------------------------------------------------------------
# Unit 18. break, continue로 반복문 제어
# ------------------------------------------------------------------------------------------------------
# 18.1 break로 반복문 끝내기
# ------------------------------------------------------------------------------------------------------
## break : 제어흐름 중단
## continue : 제어흐름 유지, 코드 실행만 건너뜀

# 18.1.1 while에서 break로 반복문 끝내기
i = 0

while True:
    print(i)
    i += 1
    if i == 100:
        break

# 18.1.2 for에서 break로 반복문 끝내기
for i in range(10):     # 0부터 10까지 반복
    print(i)
    if i == 5:          # i가 5일 때
        break           # 반복문을 끝냄. for의 제어흐름을 벗어남

# ------------------------------------------------------------------------------------------------------
# 18.2 continue로 코드 실행 건너뛰기
# ------------------------------------------------------------------------------------------------------
# 18.2.1 for에서 continue로 코드 실행 건너뛰기
for i in range(100):        # 0부터 99까지 증가하면서 100번 반복
    if i % 2 == 0:          # i를 2로 나누었을 때 나머지가 0이면 짝수
        continue            # 아래 코드를 실행하지 않고 건너뜀
    print(i)

# 18.2.2 while 반복문에서 continue로 코드 실행 건너뛰기
i = 0
while i < 100:
    i += 1
    if i % 2 == 0:
        continue
    print(i)

# ------------------------------------------------------------------------------------------------------
# 18.3 인력한 횟수대로 반복
# ------------------------------------------------------------------------------------------------------
# count = int(input('반복할 횟수를 입력하세요 :'))

# i = 0
# while True:
#     print(i)
#     i += 1
#     if i == count:
#         break

# 18.3.1 입력한 숫자까지 홀수 출력하기
# count = int(input('반복할 횟수를 입력하세요 :'))

# for i in range(count + 1):
#     if i % 2 == 0:
#         continue
#     print(i)


# ------------------------------------------------------------------------------------------------------
# Unit 19. 계단식으로 별 출력
# ------------------------------------------------------------------------------------------------------
# 19.1 중첩 루프 사용
# ------------------------------------------------------------------------------------------------------

## 중첩 루프(다중 루프) : 반복문 안에 반복문이 들어가는 형태
for i in range(5):                              # 5번 반복. 바깥쪽 루프는 세로 방향
    for j in range(5):                          # 5번 반복. 안쪽 루프는 가로 방향
        print('j:', j, sep = '', end = ' ')     # j값 출력. end에 ' '를 지정하여 줄바꿈 대신 한 칸 띄움
    print('i:', i, '\\n', sep = '')             # i값 출력, 개행 문자 모양도 출력
                                                # 가로 방향으로 숫자를 모두 출력한 뒤 다음줄로 넘어감
                                                # (print는 기본적으로 출력 후 다음 줄로 넘어감)

# ------------------------------------------------------------------------------------------------------
# 19.2 사각형으로 별 출력
# ------------------------------------------------------------------------------------------------------
for i in range(5):
    for j in range(5):
        print('*', end = '')
    print()

# 19.2.1 사각형 모양 바꾸기
for i in range(3):
    for j in range(7):
        print('*', end = '')
    print()

# ------------------------------------------------------------------------------------------------------
# 19.3 계단식으로 별 출력하기
# ------------------------------------------------------------------------------------------------------
for i in range(5):
    for j in range(5):
        if j <= i:
            print('*', end = '')
    print()

# 19.3.1 대각선으로 별 출력하기
for i in range(5):
    for j in range(5):
        if j == i:
            print('*', end = '')
        else:
            print(' ', end = '')
    print()


# ------------------------------------------------------------------------------------------------------
# Unit 20. FizzBuzz 문제
# ------------------------------------------------------------------------------------------------------
# 20.1 1부터 100까지 숫자 출력
# ------------------------------------------------------------------------------------------------------
for i in range(1, 101):
    print(i)

# ------------------------------------------------------------------------------------------------------
# 20.2 3의 배수일 때와 5의 배수일 때의 처리
# ------------------------------------------------------------------------------------------------------
for i in range(1, 101):
    if i % 3 == 0:
        print('Fizz')
    elif i % 5 == 0:
        print('Buzz')
    else:
        print(i)

# ------------------------------------------------------------------------------------------------------
# 20.3 3과 5의 공배수 처리
# ------------------------------------------------------------------------------------------------------
for i in range(1, 101):
    if i % 3 == 0 and i % 5 == 0:
        print('FizzBuzz')
    elif i % 3 == 0:
        print('Fizz')
    elif i % 5 == 0:
        print('Buzz')
    else:
        print(i)

# ------------------------------------------------------------------------------------------------------
# 20.4 논리 연산자를 사용하지 않고 3과 5의 공배수 처리
# ------------------------------------------------------------------------------------------------------
for i in range(1, 101):
    if i % 15 == 0:
        print('FizzBuzz')
    elif i % 3 == 0:
        print('Fizz')
    elif i % 5 == 0:
        print('Buzz')
    else:
        print(i)

# ------------------------------------------------------------------------------------------------------
# 20.5 코드 단축
# ------------------------------------------------------------------------------------------------------
for i in range(1, 101):
    print('Fizz' * (i % 3 == 0) + 'Buzz' * (i % 5 ==0) or i)

print('Fizz' + 'Buzz')
print('Fizz' * True)
print('Fizz' * False)

# 심사문제 : 5 와 7의 배수, 공배수 처리
start, stop = map(int, input().split())

for i in range(start, stop + 1):
    if i % 5 == 0 and i % 7 == 0:
        print('FizzBuzz')
    elif i % 5 == 0:
        print('Fizz')
    elif i % 7 == 0:
        print('Buzz')
    else:
        print(i)
